Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Licensing translations
sv: Licensiering av Ã¶versÃ¤ttningar

source: You can specify which license translations are contributed under. This is especially important to do if translations are open to the public, to stipulate what they can be used for.
sv: Du kan ange vilken licens Ã¶versÃ¤ttningarna omfattas av. Detta Ã¤r sÃ¤rskilt viktigt om Ã¶versÃ¤ttningarna Ã¤r tillgÃ¤ngliga fÃ¶r allmÃ¤nheten, fÃ¶r att faststÃ¤lla vad de fÃ¥r anvÃ¤ndas till.

source: You should specify :ref:`component` license info. You should avoid requiring a contributor license agreement, though it is possible.
sv: Du bÃ¶r ange :ref:`component` licensinformation. Du bÃ¶r undvika att krÃ¤va ett licensavtal fÃ¶r bidragsgivare, Ã¤ven om det Ã¤r mÃ¶jligt.

source: License info
sv: Licensinformation

source: Upon specifying license info (license name and URL), this info is shown in the translation info section of the respective :ref:`component`.
sv: NÃ¤r licensinformationen (licensnamn och URL) anges visas denna information i Ã¶versÃ¤ttningsinformationsavsnittet fÃ¶r respektive :ref:`component`.

source: Usually this is best place to post licensing info if no explicit consent is required. If your project or translation is not libre you most probably need prior consent.
sv: Vanligtvis Ã¤r detta den bÃ¤sta platsen att publicera licensinformation om inget uttryckligt samtycke krÃ¤vs. Om ditt projekt eller din Ã¶versÃ¤ttning inte Ã¤r fri behÃ¶ver du troligen ett fÃ¶rhandsgodkÃ¤nnande.

source: If you specify a :ref:`component-agreement`, only users who have agreed to it will be able to contribute. This is a clearly visible step when accessing the translation:
sv: Om du anger ett :ref:`component-agreement`, kommer endast anvÃ¤ndare som har godkÃ¤nt det att kunna bidra. Detta Ã¤r ett tydligt steg nÃ¤r man Ã¶ppnar Ã¶versÃ¤ttningen:

source: User licenses
sv: AnvÃ¤ndarlicenser

source: Any user can review all translation licenses of all public projects on the instance from their profile:
sv: Alla anvÃ¤ndare kan granska alla Ã¶versÃ¤ttningslicenser fÃ¶r alla offentliga projekt pÃ¥ instansen frÃ¥n sin profil:

source: Prior to Weblate 4.13, the services were configured in the :ref:`config`.
sv: FÃ¶re Weblate 4.13 konfigurerades tjÃ¤nsterna i :ref:`config`.

source: The support for several machine translation and translation memory services is built-in. Each service can be turned on by the administrator for whole site (under :guilabel:`Automatic suggestions` in :ref:`management-interface`) or at the project settings:
sv: StÃ¶d fÃ¶r flera maskinÃ¶versÃ¤ttnings- och Ã¶versÃ¤ttningsminnestjÃ¤nster Ã¤r inbyggt. Varje tjÃ¤nst kan aktiveras av administratÃ¶ren fÃ¶r hela webbplatsen (under :guilabel:`Automatiska fÃ¶rslag` i :ref:`management-interface`) eller i projektinstÃ¤llningarna:

source: They come subject to their terms of use, so ensure you are allowed to use them how you want.
sv: De omfattas av deras anvÃ¤ndarvillkor, sÃ¥ se till att du fÃ¥r anvÃ¤nda dem pÃ¥ det sÃ¤tt du vill.

source: The services translate from the source language as configured at :ref:`component`, see :ref:`component-source_language`.
sv: TjÃ¤nsterna Ã¶versÃ¤tter frÃ¥n kÃ¤llsprÃ¥ket enligt konfigurationen i :ref:`component`, se :ref:`component-source_language`.

source: Per-project automatic suggestion can also be configured via the :ref:`api`.
sv: Automatiska fÃ¶rslag per projekt kan ocksÃ¥ konfigureras via :ref:`api`.

source: Priority of machine translation and translation memory services
sv: Prioritering av maskinÃ¶versÃ¤ttning och Ã¶versÃ¤ttningsminnestjÃ¤nster

source: :ref:`mt-weblate-translation-memory` matches with 100% score take priority over machine translation services. If 100% match in translation memory is found, no machine translation is performed. If several 100% matches occur, the first one returned by the database is used.
sv: :ref:`mt-weblate-translation-memory` matchar med 100% score har prioritet framfÃ¶r maskinÃ¶versÃ¤ttningstjÃ¤nster. Om en 100-procentig matchning hittas i Ã¶versÃ¤ttningsminnet utfÃ¶rs ingen maskinÃ¶versÃ¤ttning. Om flera 100-procentiga matchningar fÃ¶rekommer anvÃ¤nds den fÃ¶rsta som returneras av databasen.

source: Each machine translation service has a predefined maximum score it can produce. The use of installed translation services is ordered according to their maximum score. For each string with translation score lower than the service's maximum, the service is asked to produce a translation. Translations with a score exceeding the current one are accepted.
sv: Varje maskinÃ¶versÃ¤ttningstjÃ¤nst har ett fÃ¶rdefinierat maximalt poÃ¤ngtal som den kan uppnÃ¥. AnvÃ¤ndningen av installerade Ã¶versÃ¤ttningstjÃ¤nster ordnas efter deras maximala poÃ¤ngtal. FÃ¶r varje strÃ¤ng med ett Ã¶versÃ¤ttningspoÃ¤ngtal som Ã¤r lÃ¤gre Ã¤n tjÃ¤nstens maximala poÃ¤ngtal ombeds tjÃ¤nsten att producera en Ã¶versÃ¤ttning. ÃversÃ¤ttningar med ett poÃ¤ngtal som Ã¶verstiger det aktuella poÃ¤ngtalet accepteras.

source: Source strings for the machine translation
sv: KÃ¤llstrÃ¤ngar fÃ¶r maskinÃ¶versÃ¤ttningen

source: The origin of source strings for all third-party services can be configured. This can be used to tweak the service to get the best results. Following choices are available:
sv: Ursprunget fÃ¶r kÃ¤llstrÃ¤ngar fÃ¶r alla tredjepartstjÃ¤nster kan konfigureras. Detta kan anvÃ¤ndas fÃ¶r att justera tjÃ¤nsten fÃ¶r att fÃ¥ bÃ¤sta resultat. FÃ¶ljande alternativ Ã¤r tillgÃ¤ngliga:

source: :guilabel:`Automatic selection`
sv: :guilabel:`Automatisk val`

source: Chooses the best source language automatically.
sv: VÃ¤ljer automatiskt det bÃ¤sta kÃ¤llsprÃ¥ket.

source: This is the default behavior.
sv: Detta Ã¤r standardbeteendet.

source: :guilabel:`Component source language`
sv: :guilabel:`KomponentkÃ¤llsprÃ¥k`

source: Uses the component source language.
sv: AnvÃ¤nder komponentens kÃ¤llsprÃ¥k.

source: This was the behavior before the 5.11 release.
sv: Detta var beteendet fÃ¶re version 5.11.

source: :guilabel:`Secondary language defined in project or component`
sv: :guilabel:`SekundÃ¤rt sprÃ¥k definierat i projekt eller komponent`

source: Use project :ref:`project-secondary_language` or component :ref:`component-secondary_language`.
sv: AnvÃ¤nd projekt :ref:`project-secondary_language` eller komponent :ref:`component-secondary_language`.

source: Falls back to the automatic selection of the source language if the secondary language not configured.
sv: Ã tergÃ¥r till automatisk val av kÃ¤llsprÃ¥k om det sekundÃ¤ra sprÃ¥ket inte Ã¤r konfigurerat.

source: Service ID
sv: TjÃ¤nst-ID

source: Maximal score
sv: Maximal poÃ¤ng

source: ``auto`` -- Automatic selection
sv: ``auto`` -- Automatiskt val

source: ``source`` -- Component source language
sv: ``source`` -- Komponentens kÃ¤llsprÃ¥k

source: ``secondary`` -- Secondary language defined in project or component
sv: ``sekundÃ¤r`` -- SekundÃ¤rt sprÃ¥k definierat i projekt eller komponent

source: Alibaba Translate is a neural machine translation service for translating text and it supports up to 214 language pairs.
sv: Alibaba Translate Ã¤r en neural maskinÃ¶versÃ¤ttningstjÃ¤nst fÃ¶r Ã¶versÃ¤ttning av text och stÃ¶der upp till 214 sprÃ¥kkombinationer.

source: A libre software machine translation platform providing translations to a limited set of languages.
sv: En fri programvaruplattform fÃ¶r maskinÃ¶versÃ¤ttning som erbjuder Ã¶versÃ¤ttningar till ett begrÃ¤nsat antal sprÃ¥k.

source: The recommended way to use Apertium is to run your own Apertium-APy server.
sv: Det rekommenderade sÃ¤ttet att anvÃ¤nda Apertium Ã¤r att kÃ¶ra din egen Apertium-APy-server.

source: `Apertium website <https://www.apertium.org/>`_
sv: `Apertiums webbplats <https://www.apertium.org/>`_

source: `Apertium APy documentation <https://wiki.apertium.org/wiki/Apertium-apy>`_
sv: `Apertium APy-dokumentation <https://wiki.apertium.org/wiki/Apertium-apy>`_

source: Advanced features
sv: Avancerade funktioner

source: Amazon Translate is a neural machine translation service for translating text to and from English across a breadth of supported languages. The service requires the `TranslateFullAccess` Managed Policy.
sv: Amazon Translate Ã¤r en neural maskinÃ¶versÃ¤ttningstjÃ¤nst fÃ¶r Ã¶versÃ¤ttning av text till och frÃ¥n engelska mellan ett stort antal sprÃ¥k som stÃ¶ds. TjÃ¤nsten krÃ¤ver den hanterade policyn `TranslateFullAccess`.

source: The service automatically uses :ref:`glossary`, see :ref:`glossary-mt`.
sv: TjÃ¤nsten anvÃ¤nder automatiskt :ref:`glossary`, se :ref:`glossary-mt`.

source: `Amazon Translate Documentation <https://docs.aws.amazon.com/translate/>`_
sv: `Amazon Translate-dokumentation <https://docs.aws.amazon.com/translate/>`_

source: ``custom`` -- Custom model
sv: ``custom`` -- Anpassad modell

source: Performs translation using `OpenAI`_ hosted on Azure.
sv: UtfÃ¶r Ã¶versÃ¤ttning med hjÃ¤lp av `OpenAI`_ som finns pÃ¥ Azure.

source: Machine translation service provided by Baidu.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst tillhandahÃ¥llen av Baidu.

source: This service uses an API and you need to obtain an ID and API key from Baidu to use it.
sv: Denna tjÃ¤nst anvÃ¤nder ett API och du mÃ¥ste skaffa ett ID och en API-nyckel frÃ¥n Baidu fÃ¶r att kunna anvÃ¤nda den.

source: Machine translation service using the Cyrtranslit library.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst som anvÃ¤nder biblioteket Cyrtranslit.

source: This service converts text between Cyrillic and Latin scripts for languages that have both scripts.
sv: Denna tjÃ¤nst konverterar text mellan kyrilliska och latinska alfabet fÃ¶r sprÃ¥k som har bÃ¥da alfabet.

source: `Cyrtranslit repository <https://github.com/opendatakosovo/cyrillic-transliteration>`_
sv: `Cyrtranslit-arkiv <https://github.com/opendatakosovo/cyrillic-transliteration>`_

source: DeepL is paid service providing good machine translation for a few languages. You need to purchase :guilabel:`DeepL API` subscription or you can use legacy :guilabel:`DeepL Pro (classic)` plan.
sv: DeepL Ã¤r en betaltjÃ¤nst som erbjuder bra maskinÃ¶versÃ¤ttning fÃ¶r ett fÃ¥tal sprÃ¥k. Du mÃ¥ste kÃ¶pa ett :guilabel:`DeepL API`-abonnemang eller sÃ¥ kan du anvÃ¤nda det Ã¤ldre :guilabel:`DeepL Pro (classic)`-abonnemanget.

source: API URL to use with the DeepL service. At the time of writing, there is the v1 API as well as a free and a paid version of the v2 API.
sv: API-URL som ska anvÃ¤ndas med DeepL-tjÃ¤nsten. Vid skrivande stund finns det v1 API samt en gratis och en betald version av v2 API.

source: ``https://api.deepl.com/v2/`` (default in Weblate)
sv: ``https://api.deepl.com/v2/`` (standard i Weblate)

source: Is meant for API usage on the paid plan, and the subscription is usage-based.
sv: Ãr avsedd fÃ¶r API-anvÃ¤ndning i den betalda planen, och abonnemanget Ã¤r anvÃ¤ndningsbaserat.

source: Is meant for API usage on the free plan, and the subscription is usage-based.
sv: Ãr avsedd fÃ¶r API-anvÃ¤ndning i gratispaketet, och abonnemanget Ã¤r anvÃ¤ndningsbaserat.

source: Is meant for CAT tools and is usable with a per-user subscription.
sv: Ãr avsedd fÃ¶r CAT-verktyg och kan anvÃ¤ndas med ett abonnemang per anvÃ¤ndare.

source: Previously Weblate was classified as a CAT tool by DeepL, so it was supposed to use the v1 API, but now is supposed to use the v2 API. Therefore it defaults to v2, and you can change it to v1 in case you have an existing CAT subscription and want Weblate to use that.
sv: Tidigare klassificerades Weblate som ett CAT-verktyg av DeepL, sÃ¥ det skulle anvÃ¤nda v1 API, men nu ska det anvÃ¤nda v2 API. DÃ¤rfÃ¶r Ã¤r v2 standardinstÃ¤llningen, och du kan Ã¤ndra det till v1 om du har ett befintligt CAT-abonnemang och vill att Weblate ska anvÃ¤nda det.

source: Weblate supports DeepL formality, it will choose matching one based on the language (for example, there is ``de@formal`` and ``de@informal``).
sv: Weblate stÃ¶der DeepL-formalitet och vÃ¤ljer en matchande variant baserat pÃ¥ sprÃ¥ket (det finns till exempel ``de@formal`` och ``de@informal``).

source: The translation context can optionally be specified to improve translations quality. Read more on that in `DeepL translation context documentation <https://developers.deepl.com/docs/best-practices/working-with-context>`_.
sv: ÃversÃ¤ttningskontexten kan valfritt anges fÃ¶r att fÃ¶rbÃ¤ttra Ã¶versÃ¤ttningens kvalitet. LÃ¤s mer om detta i `DeepL:s dokumentation om Ã¶versÃ¤ttningskontext <https://developers.deepl.com/docs/best-practices/working-with-context>`_.

source: `DeepL translator <https://www.deepl.com/translator>`_
sv: `DeepL-Ã¶versÃ¤ttare <https://www.deepl.com/translator>`_

source: `DeepL pricing <https://www.deepl.com/pro>`_
sv: `DeepL-priser <https://www.deepl.com/pro>`_

source: `DeepL API documentation <https://developers.deepl.com/docs/getting-started/intro>`_
sv: `DeepL API-dokumentation <https://developers.deepl.com/docs/getting-started/intro>`_

source: Free dictionary and translation memory for almost every living language.
sv: Gratis ordbok och Ã¶versÃ¤ttningsminne fÃ¶r nÃ¤stan alla levande sprÃ¥k.

source: The API is gratis to use, but usage of the translations is subject to the license of the used data source. There is a limit of calls that may be done from one IP in a set period of time, to prevent abuse.
sv: API:et Ã¤r gratis att anvÃ¤nda, men anvÃ¤ndningen av Ã¶versÃ¤ttningarna omfattas av licensen fÃ¶r den anvÃ¤nda datakÃ¤llan. Det finns en begrÃ¤nsning fÃ¶r antalet anrop som kan gÃ¶ras frÃ¥n en IP-adress under en viss tidsperiod, fÃ¶r att fÃ¶rhindra missbruk.

source: `Glosbe website <https://glosbe.com/>`_
sv: `Glosbe-webbplats <https://glosbe.com/>`_

source: Machine translation service provided by the Google Cloud services.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst tillhandahÃ¥llen av Google Cloud-tjÃ¤nsterna.

source: This service uses the Google Translation API v2, and you need to obtain an API key and turn on billing in the Google API console.
sv: Denna tjÃ¤nst anvÃ¤nder Google Translation API v2, och du mÃ¥ste skaffa en API-nyckel och aktivera fakturering i Google API-konsolen.

source: This service uses the Google Translation API v3 and you need credentials in JSON format to access it.
sv: Denna tjÃ¤nst anvÃ¤nder Google Translation API v3 och du behÃ¶ver inloggningsuppgifter i JSON-format fÃ¶r att fÃ¥ tillgÃ¥ng till den.

source: In order to use this service, you first need to go through the following steps:
sv: FÃ¶r att kunna anvÃ¤nda denna tjÃ¤nst mÃ¥ste du fÃ¶rst genomfÃ¶ra fÃ¶ljande steg:

source: `Setup Authentication.`_
sv: `Konfigurera autentisering.`_

source: Optionally, you can configure the service to use :ref:`glossary` by setting up a Bucket:
sv: Om du vill kan du konfigurera tjÃ¤nsten sÃ¥ att den anvÃ¤nder :ref:`glossary` genom att stÃ¤lla in en Bucket:

source: `Create a Google Cloud bucket.`_
sv: `Skapa en Google Cloud-bucket.`_

source: `Set bucket location to "us-central1".`_
sv: `StÃ¤ll in bucket-platsen till "us-central1".`_

source: `Grant 'Storage Admin' permission to the Service Account.`_
sv: `Ge tjÃ¤nstekontot behÃ¶righeten "LagringsadministratÃ¶r".`_

source: `Authenticate to Cloud services using client libraries <https://docs.cloud.google.com/docs/authentication/client-libraries>`_
sv: `Autentisera till molntjÃ¤nster med hjÃ¤lp av klientbibliotek <https://docs.cloud.google.com/docs/authentication/client-libraries>`_

source: `Creating Google Translate project <https://docs.cloud.google.com/appengine/docs/standard/nodejs/building-app/creating-project>`_
sv: `Skapa Google Translate-projekt <https://docs.cloud.google.com/appengine/docs/standard/nodejs/building-app/creating-project>`_

source: `Google Cloud App Engine locations <https://docs.cloud.google.com/appengine/docs/standard/locations>`_
sv: `Google Cloud App Engine-platser <https://docs.cloud.google.com/appengine/docs/standard/locations>`_

source: IBM Watson Language Translator
sv: IBM Watson SprÃ¥kÃ¶versÃ¤ttare

source: This service was withdrawn by vendor as of 10 December 2024.
sv: Denna tjÃ¤nst drogs tillbaka av leverantÃ¶ren den 10 december 2024.

source: LibreTranslate is a free and open-source service for machine translations. The public instance requires an API key, but LibreTranslate can be self-hosted and there are several mirrors available to use the API for free.
sv: LibreTranslate Ã¤r en gratis och Ã¶ppen kÃ¤llkodstjÃ¤nst fÃ¶r maskinÃ¶versÃ¤ttningar. Den offentliga instansen krÃ¤ver en API-nyckel, men LibreTranslate kan sjÃ¤lvhostas och det finns flera speglar tillgÃ¤ngliga fÃ¶r att anvÃ¤nda API:et gratis.

source: ``https://libretranslate.com/`` (official public instance)
sv: ``https://libretranslate.com/`` (officiell offentlig instans)

source: Requires an API key to use outside of the website.
sv: KrÃ¤ver en API-nyckel fÃ¶r att kunna anvÃ¤ndas utanfÃ¶r webbplatsen.

source: `LibreTranslate website <https://libretranslate.com/>`_
sv: `LibreTranslate-webbplats <https://libretranslate.com/>`_

source: `LibreTranslate repository <https://github.com/LibreTranslate/LibreTranslate>`_
sv: `LibreTranslate-arkiv <https://github.com/LibreTranslate/LibreTranslate>`_

source: ``api.cognitive.microsofttranslator.com`` -- Global (non-regional)
sv: ``api.cognitive.microsofttranslator.com`` -- Globalt (icke-regionalt)

source: ``api-apc.cognitive.microsofttranslator.com`` -- Asia Pacific
sv: ``api-apc.cognitive.microsofttranslator.com`` -- Asien-StillahavsomrÃ¥det

source: ``api-eur.cognitive.microsofttranslator.com`` -- Europe
sv: ``api-eur.cognitive.microsofttranslator.com`` -- Europa

source: ``api-nam.cognitive.microsofttranslator.com`` -- North America
sv: ``api-nam.cognitive.microsofttranslator.com`` -- Nordamerika

source: ``api.translator.azure.cn`` -- China
sv: ``api.translator.azure.cn`` -- Kina

source: ``api.cognitive.microsoft.com`` -- Global
sv: ``api.cognitive.microsoft.com`` -- Globalt

source: ``api.cognitive.azure.cn`` -- China
sv: ``api.cognitive.azure.cn`` -- Kina

source: ``api.cognitive.microsoft.us`` -- Azure US Government cloud
sv: ``api.cognitive.microsoft.us`` -- Azure US Government-moln

source: Machine translation service provided by Microsoft in Azure portal as a one of Cognitive Services.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst som tillhandahÃ¥lls av Microsoft i Azure-portalen som en del av Cognitive Services.

source: Weblate implements Translator API V3.
sv: Weblate implementerar Translator API V3.

source: The service automatically uses :ref:`glossary` via `dynamic dictionary <https://learn.microsoft.com/en-us/azure/ai-services/translator/dynamic-dictionary>`_, see :ref:`glossary-mt`.
sv: TjÃ¤nsten anvÃ¤nder automatiskt :ref:`glossary` via `dynamic dictionary <https://learn.microsoft.com/en-us/azure/ai-services/translator/dynamic-dictionary>`_, se :ref:`glossary-mt`.

source: Translator Text API V2
sv: ÃversÃ¤ttarens text-API V2

source: The key you use with Translator API V2 can be used with API 3.
sv: Nyckeln som du anvÃ¤nder med Translator API V2 kan anvÃ¤ndas med API 3.

source: Translator Text API V3
sv: ÃversÃ¤ttarens text-API V3

source: You need to register at Azure portal and use the key you obtain there. With new Azure keys, you also need to set ``region`` to locale of your service.
sv: Du mÃ¥ste registrera dig pÃ¥ Azure-portalen och anvÃ¤nda den nyckel du fÃ¥r dÃ¤r. Med nya Azure-nycklar mÃ¥ste du ocksÃ¥ stÃ¤lla in ``region`` till din tjÃ¤nsts lokala instÃ¤llningar.

source: You can also specify a custom category to use `custom translator <https://learn.microsoft.com/en-gb/azure/ai-services/Translator/custom-translator/concepts/customization>`_.
sv: Du kan ocksÃ¥ ange en anpassad kategori att anvÃ¤nda `custom translator <https://learn.microsoft.com/en-gb/azure/ai-services/Translator/custom-translator/concepts/customization>`_.

source: For Azure China, please use your endpoint from the Azure Portal.
sv: FÃ¶r Azure Kina, anvÃ¤nd din slutpunkt frÃ¥n Azure Portal.

source: `Cognitive Services - Text Translation API <https://azure.microsoft.com/en-us/products/ai-services/ai-translator>`_
sv: `Kognitiva tjÃ¤nster â API fÃ¶r textÃ¶versÃ¤ttning <https://azure.microsoft.com/en-us/products/ai-services/ai-translator>`_

source: `Base URLs <https://learn.microsoft.com/en-us/azure/ai-services/translator/text-translation/reference/v3/reference#base-urls>`_
sv: `Bas-URL:er <https://learn.microsoft.com/en-us/azure/ai-services/translator/text-translation/reference/v3/reference#base-urls>`_

source: `"Authenticating with a Multi-service resource" <https://learn.microsoft.com/en-us/azure/ai-services/translator/text-translation/reference/authentication#authenticating-with-a-multi-service-resource>`_
sv: "Autentisering med en multitjÃ¤nstresurs" <https://learn.microsoft.com/en-us/azure/ai-services/translator/text-translation/reference/authentication#authenticating-with-a-multi-service-resource>_

source: `"Authenticating with an access token" section <https://learn.microsoft.com/en-us/azure/ai-services/translator/text-translation/reference/authentication#authenticating-with-an-access-token>`_
sv: Avsnittet âAutentisering med en Ã¥tkomsttokenâ <https://learn.microsoft.com/en-us/azure/ai-services/translator/text-translation/reference/authentication#authenticating-with-an-access-token>_

source: Huge translation memory with machine translation.
sv: Stort Ã¶versÃ¤ttningsminne med maskinÃ¶versÃ¤ttning.

source: Free, anonymous usage is currently limited to 100 requests/day, or to 1000 requests/day when you provide a contact e-mail address in ``email``. You can also ask them for more.
sv: Gratis, anonym anvÃ¤ndning Ã¤r fÃ¶r nÃ¤rvarande begrÃ¤nsad till 100 fÃ¶rfrÃ¥gningar per dag, eller till 1000 fÃ¶rfrÃ¥gningar per dag om du anger en kontakt-e-postadress i fÃ¤ltet ``e-post``. Du kan ocksÃ¥ be dem om fler.

source: `MyMemory website <https://mymemory.translated.net/>`_
sv: `MyMemory-webbplatsen <https://mymemory.translated.net/>`_

source: Machine translation service provided by NetEase.
sv: MaskinÃ¶versÃ¤ttningstjÃ¤nst tillhandahÃ¥llen av NetEase.

source: This service uses an API, and you need to obtain key and secret from NetEase.
sv: Denna tjÃ¤nst anvÃ¤nder ett API, och du mÃ¥ste skaffa nyckel och hemlig kod frÃ¥n NetEase.

source: Performs translation using `Ollama`_ models.
sv: UtfÃ¶r Ã¶versÃ¤ttning med hjÃ¤lp av `Ollama`_-modeller.

source: The Ollama API allows for the use of open source models for translations either locally installed or remotely accessed via the `Ollama`_ service. Note that before configuring your models, you should have `Ollama installed`_ and downloaded the models you wish to use.
sv: Ollama API mÃ¶jliggÃ¶r anvÃ¤ndning av Ã¶ppen kÃ¤llkodsmodeller fÃ¶r Ã¶versÃ¤ttningar, antingen lokalt installerade eller fjÃ¤rrÃ¥tkomliga via tjÃ¤nsten `Ollama`_. Observera att innan du konfigurerar dina modeller bÃ¶r du ha `Ollama installerat`_ och ha laddat ner de modeller du vill anvÃ¤nda.

source: Use persona and style fields to further fine-tune translations. These will be used in a prompt for Ollama and allow you to change the style of the translations.
sv: AnvÃ¤nd fÃ¤lten persona och stil fÃ¶r att finjustera Ã¶versÃ¤ttningarna ytterligare. Dessa kommer att anvÃ¤ndas i en prompt fÃ¶r Ollama och gÃ¶r det mÃ¶jligt fÃ¶r dig att Ã¤ndra stilen pÃ¥ Ã¶versÃ¤ttningarna.

source: `Ollama models <https://ollama.com/search>`_
sv: `Ollama-modeller <https://ollama.com/search>`_

source: Performs translation using `OpenAI`_.
sv: UtfÃ¶r Ã¶versÃ¤ttning med hjÃ¤lp av `OpenAI`_.

source: The OpenAI API is powered by a diverse set of models with different capabilities and price points. Automatic selection chooses the best model available, but you might want to choose a specific model that matches your needs.
sv: OpenAI API drivs av en mÃ¥ngfaldig uppsÃ¤ttning modeller med olika funktioner och prisklasser. Automatisk val vÃ¤ljer den bÃ¤sta tillgÃ¤ngliga modellen, men du kanske vill vÃ¤lja en specifik modell som passar dina behov.
